benchmarks/definitive_results/theory/S_default/llama-2-7b/p75_dataset/_0.7_/log_10459367.out
WARNING 10-21 12:48:34 _custom_ops.py:19] Failed to import from vllm._C with ModuleNotFoundError("No module named 'vllm._C'")
Namespace(backend='openai', base_url=None, host='localhost', port=3537, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/data/dummy_dataset_p75.json', model='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/llama/llama-2-7b', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=3000, logprobs=None, request_rate=inf, seed=0, trust_remote_code=False, disable_tqdm=True, profile=False, save_result=True, metadata=None, result_dir='benchmarks/definitive_results/theory/S_default/llama-2-7b/p75_dataset/_0.7_', result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', launch_server=True, server_args='--port=3537 --disable-log-requests --model=/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/llama/llama-2-7b --max-num-seqs=3000 --gpu-memory-utilization=0.7', disable_log_stats=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None)
Server started
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
============ Serving Benchmark Result ============
Successful requests:                     3000      
Benchmark duration (s):                  451.14    
Total input tokens:                      1269000   
Total generated tokens:                  1074000   
Request throughput (req/s):              6.65      
Output token throughput (tok/s):         2380.64   
Total Token throughput (tok/s):          5193.52   
---------------Time to First Token----------------
Mean TTFT (ms):                          216658.48 
Median TTFT (ms):                        214628.69 
P99 TTFT (ms):                           439711.85 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          45.65     
Median TPOT (ms):                        38.11     
P99 TPOT (ms):                           74.18     
---------------Inter-token Latency----------------
Mean ITL (ms):                           45.83     
Median ITL (ms):                         33.99     
P99 ITL (ms):                            240.77    
==================================================
Concurrent checker terminated
Server terminated